{
  "auto_mapping": null,
  "base_model_name_or_path": "google-t5/t5-small",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "wi"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": null,
  "peft_type": "IA3",
  "peft_version": "0.19.1",
  "revision": null,
  "target_modules": [
    "k",
    "v",
    "wi"
  ],
  "task_type": "SEQ_2_SEQ_LM"
}