{
  "base_model_name_or_path": "Qwen/Qwen2.5-Coder-0.5B-Instruct",
  "peft_type": "BITFIT",
  "target": "parameters whose name contains 'bias'",
  "trainable_parameters": [
    "model.layers.0.self_attn.k_proj.bias",
    "model.layers.0.self_attn.q_proj.bias",
    "model.layers.0.self_attn.v_proj.bias",
    "model.layers.1.self_attn.k_proj.bias",
    "model.layers.1.self_attn.q_proj.bias",
    "model.layers.1.self_attn.v_proj.bias",
    "model.layers.10.self_attn.k_proj.bias",
    "model.layers.10.self_attn.q_proj.bias",
    "model.layers.10.self_attn.v_proj.bias",
    "model.layers.11.self_attn.k_proj.bias",
    "model.layers.11.self_attn.q_proj.bias",
    "model.layers.11.self_attn.v_proj.bias",
    "model.layers.12.self_attn.k_proj.bias",
    "model.layers.12.self_attn.q_proj.bias",
    "model.layers.12.self_attn.v_proj.bias",
    "model.layers.13.self_attn.k_proj.bias",
    "model.layers.13.self_attn.q_proj.bias",
    "model.layers.13.self_attn.v_proj.bias",
    "model.layers.14.self_attn.k_proj.bias",
    "model.layers.14.self_attn.q_proj.bias",
    "model.layers.14.self_attn.v_proj.bias",
    "model.layers.15.self_attn.k_proj.bias",
    "model.layers.15.self_attn.q_proj.bias",
    "model.layers.15.self_attn.v_proj.bias",
    "model.layers.16.self_attn.k_proj.bias",
    "model.layers.16.self_attn.q_proj.bias",
    "model.layers.16.self_attn.v_proj.bias",
    "model.layers.17.self_attn.k_proj.bias",
    "model.layers.17.self_attn.q_proj.bias",
    "model.layers.17.self_attn.v_proj.bias",
    "model.layers.18.self_attn.k_proj.bias",
    "model.layers.18.self_attn.q_proj.bias",
    "model.layers.18.self_attn.v_proj.bias",
    "model.layers.19.self_attn.k_proj.bias",
    "model.layers.19.self_attn.q_proj.bias",
    "model.layers.19.self_attn.v_proj.bias",
    "model.layers.2.self_attn.k_proj.bias",
    "model.layers.2.self_attn.q_proj.bias",
    "model.layers.2.self_attn.v_proj.bias",
    "model.layers.20.self_attn.k_proj.bias",
    "model.layers.20.self_attn.q_proj.bias",
    "model.layers.20.self_attn.v_proj.bias",
    "model.layers.21.self_attn.k_proj.bias",
    "model.layers.21.self_attn.q_proj.bias",
    "model.layers.21.self_attn.v_proj.bias",
    "model.layers.22.self_attn.k_proj.bias",
    "model.layers.22.self_attn.q_proj.bias",
    "model.layers.22.self_attn.v_proj.bias",
    "model.layers.23.self_attn.k_proj.bias",
    "model.layers.23.self_attn.q_proj.bias",
    "model.layers.23.self_attn.v_proj.bias",
    "model.layers.3.self_attn.k_proj.bias",
    "model.layers.3.self_attn.q_proj.bias",
    "model.layers.3.self_attn.v_proj.bias",
    "model.layers.4.self_attn.k_proj.bias",
    "model.layers.4.self_attn.q_proj.bias",
    "model.layers.4.self_attn.v_proj.bias",
    "model.layers.5.self_attn.k_proj.bias",
    "model.layers.5.self_attn.q_proj.bias",
    "model.layers.5.self_attn.v_proj.bias",
    "model.layers.6.self_attn.k_proj.bias",
    "model.layers.6.self_attn.q_proj.bias",
    "model.layers.6.self_attn.v_proj.bias",
    "model.layers.7.self_attn.k_proj.bias",
    "model.layers.7.self_attn.q_proj.bias",
    "model.layers.7.self_attn.v_proj.bias",
    "model.layers.8.self_attn.k_proj.bias",
    "model.layers.8.self_attn.q_proj.bias",
    "model.layers.8.self_attn.v_proj.bias",
    "model.layers.9.self_attn.k_proj.bias",
    "model.layers.9.self_attn.q_proj.bias",
    "model.layers.9.self_attn.v_proj.bias"
  ]
}