{
  "base_model_name_or_path": "openai-community/gpt2",
  "peft_type": "BITFIT",
  "target": "parameters whose name contains 'bias'",
  "trainable_parameters": [
    "transformer.h.0.attn.c_attn.bias",
    "transformer.h.0.attn.c_proj.bias",
    "transformer.h.0.ln_1.bias",
    "transformer.h.0.ln_2.bias",
    "transformer.h.0.mlp.c_fc.bias",
    "transformer.h.0.mlp.c_proj.bias",
    "transformer.h.1.attn.c_attn.bias",
    "transformer.h.1.attn.c_proj.bias",
    "transformer.h.1.ln_1.bias",
    "transformer.h.1.ln_2.bias",
    "transformer.h.1.mlp.c_fc.bias",
    "transformer.h.1.mlp.c_proj.bias",
    "transformer.h.10.attn.c_attn.bias",
    "transformer.h.10.attn.c_proj.bias",
    "transformer.h.10.ln_1.bias",
    "transformer.h.10.ln_2.bias",
    "transformer.h.10.mlp.c_fc.bias",
    "transformer.h.10.mlp.c_proj.bias",
    "transformer.h.11.attn.c_attn.bias",
    "transformer.h.11.attn.c_proj.bias",
    "transformer.h.11.ln_1.bias",
    "transformer.h.11.ln_2.bias",
    "transformer.h.11.mlp.c_fc.bias",
    "transformer.h.11.mlp.c_proj.bias",
    "transformer.h.2.attn.c_attn.bias",
    "transformer.h.2.attn.c_proj.bias",
    "transformer.h.2.ln_1.bias",
    "transformer.h.2.ln_2.bias",
    "transformer.h.2.mlp.c_fc.bias",
    "transformer.h.2.mlp.c_proj.bias",
    "transformer.h.3.attn.c_attn.bias",
    "transformer.h.3.attn.c_proj.bias",
    "transformer.h.3.ln_1.bias",
    "transformer.h.3.ln_2.bias",
    "transformer.h.3.mlp.c_fc.bias",
    "transformer.h.3.mlp.c_proj.bias",
    "transformer.h.4.attn.c_attn.bias",
    "transformer.h.4.attn.c_proj.bias",
    "transformer.h.4.ln_1.bias",
    "transformer.h.4.ln_2.bias",
    "transformer.h.4.mlp.c_fc.bias",
    "transformer.h.4.mlp.c_proj.bias",
    "transformer.h.5.attn.c_attn.bias",
    "transformer.h.5.attn.c_proj.bias",
    "transformer.h.5.ln_1.bias",
    "transformer.h.5.ln_2.bias",
    "transformer.h.5.mlp.c_fc.bias",
    "transformer.h.5.mlp.c_proj.bias",
    "transformer.h.6.attn.c_attn.bias",
    "transformer.h.6.attn.c_proj.bias",
    "transformer.h.6.ln_1.bias",
    "transformer.h.6.ln_2.bias",
    "transformer.h.6.mlp.c_fc.bias",
    "transformer.h.6.mlp.c_proj.bias",
    "transformer.h.7.attn.c_attn.bias",
    "transformer.h.7.attn.c_proj.bias",
    "transformer.h.7.ln_1.bias",
    "transformer.h.7.ln_2.bias",
    "transformer.h.7.mlp.c_fc.bias",
    "transformer.h.7.mlp.c_proj.bias",
    "transformer.h.8.attn.c_attn.bias",
    "transformer.h.8.attn.c_proj.bias",
    "transformer.h.8.ln_1.bias",
    "transformer.h.8.ln_2.bias",
    "transformer.h.8.mlp.c_fc.bias",
    "transformer.h.8.mlp.c_proj.bias",
    "transformer.h.9.attn.c_attn.bias",
    "transformer.h.9.attn.c_proj.bias",
    "transformer.h.9.ln_1.bias",
    "transformer.h.9.ln_2.bias",
    "transformer.h.9.mlp.c_fc.bias",
    "transformer.h.9.mlp.c_proj.bias",
    "transformer.ln_f.bias"
  ]
}